tap "homebrew/bundle"
tap "libsql/sqld"
tap "tursodatabase/tap"
brew "sqlite"
brew "python@3.13"
brew "awscli"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "goose"
brew "gosec"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "make"
brew "utf8proc"
brew "neovim"
brew "poppler"
brew "postgresql@17", link: true
brew "python-tk@3.13"
brew "ripgrep"
brew "sevenzip"
brew "sqlc"
brew "staticcheck"
brew "unzip"
brew "vale"
brew "wget"
brew "xclip"
brew "yazi"
brew "zig"
brew "zoxide"
brew "tursodatabase/tap/turso"
cask "appcleaner"
cask "bitwarden"
cask "docker"
cask "dolphin"
cask "firefox@nightly"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-cloud-sdk"
cask "heroic"
cask "microsoft-edge@canary"
cask "onlyoffice"
cask "pgadmin4"
cask "raycast"
cask "spotify"
cask "visual-studio-code@insiders"
cask "webull"
cask "whisky"
cask "zed@preview"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vsliveshare.vsliveshare"
vscode "postman.postman-for-vscode"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
