tap "anomalyco/tap", trusted: true
tap "charmbracelet/tap", trusted: true
tap "homebrew/bundle"
tap "jstkdng/programs", trusted: true
tap "libsql/sqld", trusted: true
tap "modem-dev/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "sst/tap", "https://github.com/anomalyco/homebrew-tap.git", trusted: true
tap "tursodatabase/tap", trusted: true
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Go Language's command-line interface for database migrations
brew "goose"
# Golang security checker
brew "gosec"
# Post-modern modal text editor
brew "helix"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Deep clean and optimize your Mac
brew "mole"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI agent toolkit
brew "pi-coding-agent"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Generate type safe Go from SQL
brew "sqlc"
# State of the art linter for the Go programming language
brew "staticcheck"
# General purpose fuzzy finder TUI
brew "television"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python type checker, written in Rust
brew "ty"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# Access X11 clipboards from the command-line
brew "xclip"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk"
brew "tursodatabase/tap/turso"
# Image editing and design software
cask "affinity"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Send any size file between devices
cask "blip"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Emulator to play GameCube and Wii games
cask "dolphin"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game launcher
cask "heroic"
# Multi-platform web browser
cask "microsoft-edge@canary"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Document editor
cask "onlyoffice"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code@insiders"
# Desktop client for Webull Financial LLC
cask "webull"
# Wine wrapper built with SwiftUI
cask "whisky"
# Connect to Windows
cask "windows-app"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Multiplayer code editor
cask "zed@preview"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "ziglang.vscode-zig"
go "github.com/bootdotdev/bootdev"
go "graphics.gd/cmd/gd"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/maaslalani/sheets"
go "solod.dev/cmd/so"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/Fepozopo/timp/cmd/timp"
